# Brewfile
# https://robots.thoughtbot.com/brewfile-a-gemfile-but-for-homebrew

## TODO
# https://github.com/rupa/z

# Configure where our applications go
cask_args appdir: '/Applications'


# Install homebrew packages
brew "grc"
brew "coreutils"
brew "spark"

# upgrade rsync 2.6.9 -> 3.1.2
brew "rsync"

#
brew "git-flow"

# Small wrapper around `launchctl` for supported formulae, commands available:
#
#   elasticsearch
#   mongo
#   postgres
#
#  Then its simple as :
#
#  brew services restart <service>
#
#
tap "homebrew/services"

# System
brew "zsh" # 5.3.1
brew "openssl"
brew "vim"
brew "p7zip" # 7z port

# ag
# https://github.com/ggreer/the_silver_searcher
brew "the_silver_searcher"

# General development
brew "bower"
brew "git"
brew "yarn"
brew "nvm"
brew "hub"
brew "s3cmd"

# react-native
brew "watchman"

# Databases
brew "postgresql"
brew "redis"

# Tools
brew "wget"

# "better" grep
brew "ack"

# get brew cask for apps
tap 'caskroom/cask'

# install the apps we want
# cask 'google-chrome'
# cask 'dropbox'
# cask 'spotify'
# cask 'slack'



